Repository: mzvch/obrona
Catalog: pockets/translations/validators.*.xlf
Languages: pl

# user_email_unique
source: User with the given e-mail address already exists.
pl: Użytkownik o podanym adresie e-mail już istnieje.

# user_first_name_not_blank
source: You must enter your first name.
pl: Musisz podać swoje imię.

# user_first_name_max_length
source: Your first name can be up to 30 characters long.
pl: Twoje imię może zawierać maksymalnie 30 znaków.

# user_last_name_not_blank
source: You must enter your last name.
pl: Musisz podać swoje nazwisko.

# user_last_name_max_length
source: Your last name can be up to 50 characters long.
pl: Twoje nazwisko może zawierać maksymalnie 50 znaków.

# user_email_not_blank
source: You must enter your e-mail address.
pl: Musisz podać swój adres e-mail.

# user_email_max_length
source: Your e-mail address can be up to 50 characters long.
pl: Twój adres e-mail może zawierać maksymalnie 50 znaków.

# user_email_format
source: Your email address is not in the correct format.
pl: Twój adres e-mail ma niepoprawny format.

# user_password_not_same
source: The passwords entered must be the same.
pl: Wpisane hasła muszą być takie same.

# user_password_not_blank
source: You must enter a password for your account.
pl: Musisz podać hasło do swojego konta.

# user_password_min_length
source: Your password must be at least 15 characters long.
pl: Twoje hasło musi zawierać co najmniej 15 znaków.

# user_password_max_length
source: Your password must be 64 characters or less.
pl: Twoje hasło musi posiadać co najwyżej 64 znaki.

# user_agree_terms_is_true
source: You must accept the terms of our website.
pl: Musisz zaakceptować regulamin naszego serwisu.

# pocket_name_not_blank
source: You must enter a pocket name.
pl: Musisz podać nazwę portfela.

# pocket_name_max_length
source: The pocket name can be up to 30 characters long.
pl: Nazwa portfela może zawierać maksymalnie 30 znaków.

# pocket_account_balance_greater_than_or_equal
source: The pocket balance cannot be lower than 0 PLN.
pl: Saldo portfela nie może być niższe niż 0 PLN.

# financial_transaction_title_not_blank
source: You must provide a title for the transaction.
pl: Musisz podać tytuł operacji.

# financial_transaction_title_max_length
source: The transaction title can be up to 30 characters long.
pl: Tytuł operacji może zawierać maksymalnie 30 znaków.

# financial_transaction_amount_not_blank
source: You must enter the amount of the transaction.
pl: Musisz podać kwotę operacji.

# financial_transaction_amount_not_equal_to
source: The transaction amount cannot be equal to 0 PLN.
pl: Kwota operacji nie może być równa 0 PLN.

# change_password_not_same
source: The passwords entered must be the same.
pl: Wpisane hasła muszą być takie same.

# change_password_not_blank
source: You must enter a new password for your account.
pl: Musisz podać nowe hasło do swojego konta.

# change_password_min_length
source: Your password must be at least 15 characters long.
pl: Twoje hasło musi zawierać co najmniej 15 znaków.

# change_password_max_length
source: Your password must be 64 characters or less.
pl: Twoje hasło musi posiadać co najwyżej 64 znaki.
